# Напишите функцию, которая будет принимать номер кредитной карты и
# показывать только последние 4 цифры. Остальные цифры должны заменяться
# звездочками

# def bank(Nomer):
#     Nomer2 = Nomer.replace(' ', '')
#     Nomer3 = Nomer
#     if Nomer2.isalpha() == True:
#         print('номер состоит только из цифр (меня не обманешь)')
#     elif len(Nomer2) > 16 or len(Nomer2) < 16:
#         print('Вы ошиблись с количеством цифр, повторите попытку, хотя это ваше дело)')
#     else:
#         Nomer3 = list(Nomer3)
#         Nomer3[:15:] = "**** **** **** "
#         Nomer3 = ''.join(Nomer3)
#     print(Nomer3)
# Nomer = input('Введите номер кредитной карты (или не вводите): ')
# bank(Nomer)

# Напишите функцию, которая проверяет: является ли слово палиндромом

# def polidrom(a):
#     a = str(a)
#     a = a.strip()
#     for i in a:
#         if i.isdigit() == True:
#             print("Вы написали цифру, не надо так")
#             exit()
#         elif i == " ":
#             print('Вы написали несколько слов, не надо так')
#             exit()
#         elif i.isalpha():
#             pass
#         else:
#             print("Кажеться вы написали что-то совсем не то")
#             exit()
#     if a == a[::-1]:
#         print('Полидром')
#
#     else:
#         print("Не полидром")
# a = input('Введите слово проверяемое на полидром: ')
# polidrom(a)

